[
     {
        "name": "Carla Y Nunez",
        "message": "I had never experienced the Himalayan Meditation but as I began to use it, I fell in love with it! The Graphics, the music and mantras are all great! Soothing and it makes me feel like if I was in another place in another time. The messages it has as well, are very relaxing practicing mindfulness and having a calm meditative mind through out the day. Good for when you're feeling stressed out or blocked. I recommend this app and hope you can add more features to it!! Thank you 💚🙏👳‍♂️",
        "location": ""
    },
    {
        "name": "Jothindra paranji lakshminarayana",
        "message": "The presentation is awesome. Well planned. Need not go in search of music anywhere else. The voice and the background music is such that it puts one into a meditative mood right away. Will certainly change one's life if followed daily. Will make you more energetic, calmer, more productive, less stressful. Wish I had been introduced to it earlier. Press Open- next square box in the middle-Guided Mode-Download-Play.The buttons below to operate clashes with the phones.Correct it.",
        "location": ""
    },
    {
        "name": "Divya Gulakavarapu",
        "message": "Great! Time, is something which doesn't go for favouritism, which independently keeps on rotating. After joining the program I can equivalently see that, my tasks are completing rather much faster than the days where I struggle to complete my day to day activities. I understood the value of time. I understood the value of each hour, each minute , each second and especially each breathe. For that I'm very grateful, and will always be thankful",
        "location": ""
    },
    {
        "name": "Mariam Mimi",
        "message": "I have downloaded alot of meditation app that i later deleted cause i could not connect with it. But this,this is so wonderful. It's filled with so many technic that is easy to understand and use. I'm so grateful and i bet I'll hold on to the fantastic app. Thumbs up guys for creating this app",
        "location": ""
    },
    {
        "name": "Bri Irons",
        "message": "If i could give this 100 stars i would this is the best free meditation app ever my most used too love the interface and how its so easy to use and learn for beginners im showing it too but also good for advanced meditators like myself really puts me in a good mood after using it highly recommend it ...",
        "location": ""
    },
    {
        "name": "Sanal Sahadev",
        "message": "It's really a great knowledge sharing app.. I really love it. Last some years I were researching behind the spiritual knowledge and spiritual experience getting shortcuts. I started to feel that's all shortcuts never be long lasting and it never fulfil our desires, started to find a good guru who will...",
        "location": "India"
    },
    {
        "name": "Carla Y Nunez",
        "message": "I had never experienced the Himalayan Meditation but as I began to use it, I fell in love with it! The Graphics, the music and mantras are all great! Soothing and it makes me feel like if I was in another place in another time. The messages it has as well, are very relaxing practicing mindfulness an...",
        "location": ""
    },
    {
        "name": "Aditya Pande",
        "message": "I Thank the makers and creators of this app from the deepest of my heart. I m using this app for last 1 month and it has changed my life and my way of thinking and living considerably. Expressing my gratitude.",
        "location": "India"
    },
    {
        "name": "Mandvi singh",
        "message": "Have downloaded it today only ..... Better one than any other app what so ever I have used so far for meditation....",
        "location": "India"
    },
   
    {
        "name": "Lin Aljabri",
        "message": "Amazing app! Seriously haven't came across anything like it for meditation.",
        "location": "India"
    },
    {
        "name": "Soumalya roy",
        "message": "I am not only giving 5 star but also i am giving 5000 star for this valuable app. This is not only a meditation app. This is the app for a spiritual journey. Who wants to feel the existance of god, he/she can follow the instruction in this app. Thank you so much for making thus valuable app for us. ...",
        "location": "India"
    },
    {
        "name": "Krishna Veni",
        "message": "Really good app, u can feel that Himalaya s garu is teaching us physical, u can learn all kinds of meditation and yoga class as per Vedic book",
        "location": "India"
    },
    {
        "name": "ShwetSar",
        "message": "Life transforming app, best use of technology, beautifully designed and user friendly. Much needed dose of wisdom that helps to guide through the doorway to spirituality, connect with the Supreme.",
        "location": "India"
    },
    {
        "name": "Amit Badlani",
        "message": " This is the Best app on the play store. Kudos to the team for making such a flawless app! I can't thank enough for the work that you have put into this app to make this app this perfect. Thank you so much. I am lucky to have come across this app. Keep up the great work. Thanks once again. ",
        "location": "India"
    },
    {
        "name": "Ridley Dautruche",
        "message": "This application produces results for my intended purposes. I thank you for making this great tool!",
        "location": "Not Known"
    },
    {
        "name": "Brittney Smith",
        "message": "I really enjoy this app! Turned out to be way more than I was expecting.",
        "location": "India"
    },
    {
        "name": "PlanetDave 2019",
        "message": "I am peace due to this life saving app, made with love and wisdom. Thank you ☀️♥️🙏🏻",
        "location": "India"
    },
    {
        "name": "D Sharma",
        "message": "Beyond the unexpected and it's the most precious technological application human being has ever created for the transformation of the soul...I'm completely transformed...god bless the developer.",
        "location": "India"
    },
    {
        "name": "Harshada Abnave",
        "message": "Best app ever....guides honestly and perfectly.....very nice app....it don't demand money .....thank u soo much....",
        "location": "India"
    },
    {
        "name": "Harish Sharma",
        "message": "It's an absolute classic work of Art, I really appreciate that such apps are there to guide us through! What a Gem! Recently started using this app and I am amazed to know such universal truths...",
        "location": "India"
    },
    {
        "name": "SRINIVASAN CK",
        "message": "Lot of information every one enjoys through this app it gives virtual real time express. Good effort and hard work implementation",
        "location": "India"
    },
    {
        "name": "Stuart",
        "message": "Thank you, it's a great meditation app, I will be using this for months to come. I will recommend it too!",
        "location": "Not Known"
    },
    {
        "name": "Manash Mallick",
        "message": "Fantastic... Very peaceful. As a student I am feeling huge transformation within me. Thank you for this.",
        "location": "India"
    },
    {
        "name": "Toral Vani",
        "message": "Amazing app...i have Downloaded lot of app meditation but.this one is really amazing..even if you dont know how to meditate still you can do it well by using this app's guided mode.",
        "location": "India"
    },
    {
        "name": "Satya Mohapatra",
        "message": "THM is pure essence of higher consciousness which manifest heavenly shower from the supreme blessing. Himalayan meditation is a wonderful team with their extraordinary skill and visibility to build such an unique application for the whole world which will be a history in the great path. ",
        "location": "India"
    },
    {
        "name": "Gyan Ranjan",
        "message": "Never thought such app can be designed so beautifully. Hats off to team who made this possible. Calm and tranquility are by product of these meditations....",
        "location": "India"
    },
    {
        "name": "Umakumar Sarana",
        "message": "This is The best app I never ever seen before, Through this app every one can achieve his/her desires in life by practicing these methods. I suggest everyone to download and follow as per their guidance, you can see n achieve miracles in your Life, I am thanking from my bottom of heart to their effort...",
        "location": "India"
    },
    {
        "name": "Alex P",
        "message": "Unbelievably helpful application to help to fight with mental craziness of Corona Virus outbreak",
        "location": "Not Known"
    },
    {
        "name": "Ill Felon",
        "message": "Top shelf this is what a meditation app looks like take notes",
        "location": "Not Known"
    },
    {
        "name": "wendi daugherty-gore",
        "message": "Nice to have easy mobile meditations",
        "location": "Not Known"
    },
    {
        "name": "Achal Singh",
        "message": "Adbhut, this is too good app I am so happy by using this app.",
        "location": "India"
    },
    {
        "name": "Porus Katrak",
        "message": "Best in the world. Hats off to the developers",
        "location": "India"
    },
    {
        "name": "Vinkal Saluja",
        "message": "Sun meditation seems to take into another realm, could you see sun inside you...trying inverted tree...experiential bliss..thanks",
        "location": "India"
    },
    {
        "name": "RAHUL KUMAR",
        "message": "Wow very nice experience Thanks you sir om sound meditation is very melodic.",
        "location": "India"
    },
    {
        "name": "Ananta Swain",
        "message": "very helpful for people who want to do spiritual sadhana",
        "location": "India"
    },
    {
        "name": "Eqoiq Services",
        "message": "Professional growth, clarity, focus, undivided attention or personal control over breath, anxiety, attaining warmth, patience... Seems they just got it right..good luck..looking forward to progressing to the next levels...",
        "location": "India"
    },

    {
        "name": "Reema Kumari",
        "message": "Amazed by the content and such wonderful meditations.very grateful to team who made this possible.",
        "location": "India"
    },
    {
        "name": "Simple Skilz",
        "message": "Third eye opened immediately",
        "location": "Not Known"
    },
    {
        "name": "FireWithin CosmosaicS.E.A",
        "message": "If i could give 10 stars i would🙏🏼🌺 thank you",
        "location": "India"
    },
    {
        "name": "RishiNaadam",
        "message": "Words can not describe its beauty. If there is something like 100 stars then also less for this divine treasure... Request all to feel it to heal yourself ...",
        "location": "India"
    },
    {
        "name": "S Gha",
        "message": "This the best and most practical meditation app out there.. I think! Thank you developer's.",
        "location": "India"
    },
    {
        "name": "S Gha",
        "message": "This the best and most practical meditation app out there.. I think! Thank you developer's.",
        "location": "India"
    }
]
